{
    "Italy": [
        {
            "title": "Panettone",
            "ingredients": [
                "⅓ cup warm water (110 degrees F/45 degrees C)",
                "2 (.25 ounce) packages active dry yeast",
                "4 cups all-purpose flour",
                "½ cup warm milk",
                "⅔ cup white sugar",
                "4 large eggs",
                "2 large egg yolks",
                "1 teaspoon vanilla extract",
                "12 tablespoons unsalted butter",
                "2 cups candied mixed fruit",
                "2 ½ teaspoons grated lemon zest",
                "2 tablespoons orange zest",
                "2 tablespoons butter, melted",
                "1  egg yolk",
                "1 tablespoon cream",
                "3 (7 x 4-inch) round paper panettone molds"
            ],
            "method": [
                "To make sponge, warm a small bowl by rinsing it with hot water. Pour in warm water and sprinkle 1 package yeast on it. Let stand until yeast has dissolved. Stir in 1/2 cup flour, cover with plastic wrap, and let stand 30 minutes, or until doubled. Sprinkle remaining yeast over warm milk. Let stand until dissolved. Beat together sugar, eggs, egg yolks, and vanilla. Stir in milk-yeast mixture. Add sponge and stir until well incorporated.",
                "Combine butter and remaining 3 ½ cups flour until crumbly. Slowly pour in egg mixture and beat on high speed 3 to 4 minutes, until dough is elastic looking and long strands form. Beat in fruit and zests. Turn dough into oiled bowl, cover with plastic wrap, and leave in a warm place to rise until doubled, about 2 to 3 hours.",
                "Brush inside of three 7 x 4-inch paper molds with melted butter. Turn dough out onto a lightly floured work surface and knead a few times to deflate. Divide dough into 3 pieces. Roll each piece into a ball and drop into prepared molds; place on a baking sheet about 4-inches apart and cover loosely with plastic wrap. Let rise in a warm place until doubled again, about 2 hours.",
                "Preheat the oven to 400 degrees F (200 degrees C). Cut an X in top of each loaf with oiled scissors. Combine egg yolk with cream. Brush tops of loaves lightly with egg wash.",
                "Place baking sheet with loaves in bottom 1/3 of preheated oven. After 10 minutes, lower heat to 375 degrees F (190 degrees C). Continue to bake for 30 more minutes; if tops get too brown, cover with foil. Loaves are done when a wooden skewer inserted into centers comes out clean. Cool on wire rack."
            ]
        },
        {
            "title": "Pasta e Ceci (Italian Chickpea and Pasta Stew)",
            "ingredients": [
                "1 cup dry chickpeas",
                "1 tablespoon baking soda",
                "1  yellow onion",
                "1 stalk celery",
                "1 small zucchini",
                "1  carrot",
                "2 tablespoons olive oil",
                "1  sage leaves",
                "1  fresh rosemary",
                "1  fresh thyme",
                "3 cups chicken broth, or more as needed",
                "2 peeled whole canned tomatoes",
                "8 ounces ditalini",
                "salt and freshly ground black pepper to taste",
                "1  cayenne pepper, seeded and minced, or more to taste",
                "1 tablespoon extra virgin olive oil"
            ],
            "method": [
                "Rinse chickpeas under cool water. Pick up handfuls of chickpeas and rub them together with your hands under the water to wash chickpeas. Place chickpeas in a large stew pot, cover with water and add baking soda; swirl chickpeas and water to distribute baking soda. Leave to soak for 8 hours or overnight.",
                "The next day, pour chickpeas through a strainer and rinse well under cold running water, eliminating any skins or discolored chickpeas; set aside.",
                "Grate onion, celery, zucchini, and carrot on the large teeth of a cheese grater, This step is very important as grated vegetables give a different flavor than diced.",
                "Heat 2 tablespoons olive oil in the stew pot over medium heat, and sauté grated vegetables for 1 minute. Mix in sage, rosemary, and thyme and sauté, stirring occasionally, until onions are soft and translucent, about 5 minutes.",
                "Add 3 cups broth, all the chickpeas, and tomatoes. Bring to a boil, reduce heat, and simmer until chickpeas are tender, about 1 hour. Stir in pasta. Add more broth only as needed to achieve a thick, stew-like consistency.",
                "Cook until pasta is tender with a bite, 8 to 10 minutes. Taste and season with salt and black pepper. Remove from heat and divide amongst serving bowls. Top each bowl with minced cayenne pepper and a drizzle of extra-virgin olive oil."
            ]
        },
        {
            "title": "Grilled Pizza Bianca",
            "ingredients": [
                "1 tablespoon butter",
                "1 clove garlic, minced",
                "1/3 cup heavy cream",
                "1 cup grated Parmesan cheese, divided",
                "1 pound pizza dough",
                "8 slices mozzarella cheese"
            ],
            "method": [
                "Melt butter in a small saucepan over medium-high heat. Add garlic and cook until fragrant, about 30 seconds; stir in cream. Add 2/3 cup Parmesan cheese, and stir until smooth. Let Alfredo sauce cool to room temperature, about 15 minutes.",
                "Meanwhile, preheat a gas grill with all burners on High for 10 to 15 minutes.",
                "Divide pizza dough in half. Shape each portion of the pizza dough into an 8 to 10-inch disc. Reduce the flame on half the grill burners to Low, to create areas of direct and indirect heat.",
                "Carefully place discs of dough, one at a time, onto the grill over direct heat. Close the cover. Let dough grill until the bottom is just barely cooked and shows char marks, 1 to 3 minutes.",
                "Turn crust ninety degrees (do not flip dough over). Grill until crust shows light grill marks, 1 to 3 minutes.",
                "Move pizza dough to indirect heat. Spoon Alfredo sauce over dough. Top each crust with four slices mozzarella cheese. Sprinkle remaining 1/3 cup Parmesan cheese evenly over pizzas.",
                "Grill until cheese is melted, about 3 minutes. Carefully remove pizza from the grill.",
                "Preheat the oven’s broiler. Broil pizza until cheese is golden, about 5 minutes. Allow pizza to rest a few minutes before cutting into wedges."
            ]
        },
        {
            "title": "Italian BLT",
            "ingredients": [
                "1 loaf italian bread",
                "1 tablespoon olive oil, or as needed",
                "1 tablespoon italian seasoning",
                "1 teaspoon garlic granules",
                "2 cups spinach",
                "1/3 cup basil leaves",
                "2  tomatoes, sliced",
                "8 ounces fresh mozzarella cheese, sliced",
                "12 ounces prosciutto",
                "1/3 cup ricotta",
                "1 tablespoon pesto"
            ],
            "method": [
                "Slice bread on the diagonal to get 12 slices.",
                "Brush each slice of bread with olive oil. Mix Italian seasoning and garlic granules together; sprinkle over bread slices.",
                "Heat a grill pan over medium-high heat, and place bread oil-side-down on the pan until grill marks form, about 3 minutes. Remove bread to a board.",
                "Mix spinach and basil leaves together. Divide leaves evenly over 6 slices of bread; layer these 6 bread slices with equal amounts prosciutto, sliced tomato, and sliced mozzarella.",
                "Stir pesto and ricotta together in a small bowl. Spread a generous 1 tablespoon mixture onto remaining 6 bread slices, and place on top of each sandwich."
            ]
        }
    ],
    "France": [
        {
            "title": "Ratatouille",
            "ingredients": [
                "2 tablespoons olive oil, divided",
                "3 cloves garlic, minced",
                "1  eggplant, cut into 1/2 inch cubes",
                "2 teaspoons dried parsley",
                "salt to taste",
                "1 cup grated Parmesan cheese",
                "2  zucchini, sliced",
                "2 large tomatoes, chopped",
                "2 cups sliced fresh mushrooms",
                "1 large onion, sliced into rings",
                "1  green or red bell pepper, sliced"
            ],
            "method": [
                "Preheat the oven to 350 degrees F (175 degrees C). Coat the bottom and sides of a 1 1/2-quart casserole dish with 1 tablespoon olive oil.",
                "Heat remaining 1 tablespoon olive oil in a medium skillet over medium heat. Cook and stir garlic until fragrant and golden brown. Add eggplant and parsley; cook and stir until eggplant is tender and soft, about 10 minutes. Season with salt to taste.",
                "Spread eggplant mixture evenly across the bottom of the prepared casserole dish; sprinkle with a few tablespoons of Parmesan cheese. Spread zucchini in an even layer over top. Lightly salt and sprinkle with a little more cheese. Continue layering in this fashion, with tomatoes, mushrooms, onion, and bell pepper, covering each layer with a sprinkling of salt and cheese.",
                "Bake in preheated oven until vegetables are tender, about 45 minutes."
            ]
        },
        {
            "title": "Macarons",
            "ingredients": [
                "4  extra large egg whites",
                "1 ⅔ cups confectioners' sugar",
                "1 ⅓ cups almond flour",
                "⅛ teaspoon salt",
                "¼ cup superfine (castor) sugar",
                "¼ cup seedless raspberry jam"
            ],
            "method": [
                "Place egg whites into a metal mixing bowl and refrigerate overnight. The next day, bring egg whites to room temperature.",
                "Preheat the oven to 280 degrees F (138 degrees C). Line two baking sheets with parchment paper.",
                "Whisk confectioners' sugar and almond flour together in a bowl.",
                "Beat egg whites with salt in a metal bowl with an electric mixer on medium speed until foamy, about 1 minute. Increase speed to high and gradually beat in superfine sugar, about 1 tablespoon at a time, until egg whites are glossy and hold stiff peaks, 3 to 5 more minutes.",
                "Gently fold almond flour mixture into whipped egg whites until thoroughly incorporated; spoon meringue into a pastry bag fitted with a 3/8-inch tip. Pipe 1-inch disks of meringue onto the prepared baking sheets, leaving 2 inches of space between macarons. The batter will spread.",
                "Lift the baking sheets a few inches above the work surface and hit them lightly on the work surface several times to remove any air bubbles from the macarons; let stand at room temperature until the shiny surfaces become dull and a thin skin forms, about 25 to 30 minutes.",
                "Place the baking sheets in the preheated oven and bake until macarons surfaces are completely dry, about 19 to 20 minutes. Let macarons cool completely on the baking sheets before peeling parchment paper off.",
                "Spread half of the macaron cookies with any desired filling; top with remaining macarons to make sandwich cookies, and refrigerate at least 2 hours to overnight to let them soften."
            ]
        },
        {
            "title": "Apple Tarte Tatin",
            "ingredients": [
                "3 tablespoons butter",
                "¾ cup white sugar",
                "3 large Granny Smith apples - peeled, cored, and quartered",
                "1 tablespoon all-purpose flour",
                "1  9-inch unbaked pie crust"
            ],
            "method": [
                "Preheat the oven to 425 degrees F (220 degrees C).",
                "Coat a 10-inch oven-proof skillet with butter. Sprinkle sugar evenly over the top of the butter.",
                "Place apple quarters, rounded sides down, on top of the butter and sugar in a circular pattern.",
                "Place skillet over medium-high heat and cook until butter melts and sugar dissolves and begins to caramelize. Continue to cook until apples soften and caramel begins to brown, 10 to 12 minutes. Remove from heat.",
                "Sprinkle work surface with flour and roll pie dough into an 11-inch circle. Pinch edge to create a ruffle around crust.",
                "Place crust on top of apples and tuck in edges around apples.",
                "Bake in the preheated oven until crust is golden brown, about 20 minutes. Allow to cool for 5 minutes. Place a plate over the top of the pan and carefully invert to release tarte from the pan. Scrape any remaining apples stuck to the pan back on top of crust."
            ]
        },
        {
            "title": "Basic Crêpes",
            "ingredients": [
                "1 cup all-purpose flour",
                "2 large eggs",
                "½ cup milk",
                "½ cup water",
                "¼ teaspoon salt",
                "2 tablespoons butter, melted"
            ],
            "method": [
                "Whisk flour and eggs together in a large mixing bowl; gradually add in milk and water, stirring to combine. Add salt and melted butter; beat until smooth.",
                "Heat a lightly oiled griddle or frying pan over medium-high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each crêpe. Tilt the pan with a circular motion so that the batter coats the surface evenly.",
                "Cook until the top of the crêpe is no longer wet and the bottom has turned light brown, 1 to 2 minutes. Run a spatula around the edge of the skillet to loosen the crêpe; flip and cook until the other side has turned light brown, about 1 minute more. Serve hot."
            ]
        }
    ],
    "Morocco": [
        {
            "title": "Aburi Steak",
            "ingredients": [
                "1 (12 ounce boneless rib eye steak",
                "1/2 cup white rice",
                "3/4 cup water",
                "2 teaspoons rice vinegar",
                "1 teaspoon sugar",
                "1/2 teaspoon salt",
                "1/4 cup soy sauce",
                "1 tablespoon maple syrup",
                "1 tablespoon sambal oelek",
                "1 tablespoon vegetable oil",
                "1/3 cup sour cream",
                "1/4 teaspoon lime zest",
                "2 teaspoons lime juice",
                "2 teaspoons wasabi paste, or more to taste",
                "2 teaspoons toasted sesame seeds"
            ],
            "method": [
                "Put steak on a waxed paper-lined baking sheet. Freeze until just firm, about 1 hour.",
                "Meanwhile, for sushi rice, rinse rice under cold running water, rubbing grains together with your fingers. Combine rice and water in a small saucepan. Bring to a boil; reduce heat to low. Simmer, covered, until tender and sticky, about 15 minutes. Remove from heat. Stir together vinegar, sugar, and salt in a small bowl. Stir into rice. Cover; let cool about 45 minutes.",
                "Meanwhile, thinly slice steak across the grain into 24 (1/4-inch-thick) slices. Transfer steak to a zip-top bag set in a shallow dish.",
                "Whisk together soy sauce, maple syrup, chili paste, and oil in a small bowl. Pour over steak in bag; seal bag. Chill at least 20 minutes or up to 2 hours.",
                "For sauce, whisk together sour cream, lime zest, lime juice, and wasabi paste.",
                "Shape rice with wet hands into 24 (1-tablespoon) oval-shaped portions. Drain steak; discard marinade. Put steak on a foil-lined baking sheet set on a wire rack. Char steak with a kitchen torch, turning once, until desired doneness, about 5 minutes for entire recipe. Put 1 steak piece on each rice portion. Sprinkle with furikake seasoning and serve with sauce."
            ]
        },
        {
            "title": "Mochi Muffins",
            "ingredients": [
                "2 cups glutinous sweet rice flour (such as Mochiko)",
                "3/4 cup packed brown sugar",
                "1/4 cup white sugar",
                "2 teaspoons baking powder",
                "1 teaspoon salt",
                "1 (14-ounce) can unsweetened coconut milk",
                "2 large eggs",
                "1/4 cup butter, melted",
                "2 teaspoons vanilla extract",
                "2 teaspoons maple syrup",
                "1 teaspoon sesame seeds",
                "1 teaspoon sesame seeds"
            ],
            "method": [
                "Gather all ingredients.",
                "Preheat the oven to 350 degrees F (175 degrees C). Line twelve 2 1/2-inch muffin cups with paper bake cups or grease cups generously.",
                "Whisk together rice flour, sugars, baking powder, and salt in a bowl.",
                "Whisk together coconut milk, eggs, butter, vanilla, and maple syrup in a large bowl. Add flour mixture to coconut milk mixture and stir just until combined.",
                "Divide batter between prepared muffin cups, filling nearly full. Sprinkle with sesame seeds.",
                "Bake in preheated oven until a toothpick inserted in the center comes out clean, 40 to 45 minutes. Cool in pan on a wire rack 10 minutes. Remove from pan and serve warm or cool completely."
            ]
        },
        {
            "title": "Air Fryer Chicken Katsu with Homemade Katsu Sauce",
            "ingredients": [
                "½ cup ketchup",
                "2 tablespoons soy sauce",
                "1 tablespoon brown sugar",
                "1 tablespoon sherry",
                "2 teaspoons Worcestershire sauce",
                "1 teaspoon minced garlic"
            ],
            "method": [
                "Prepare sauce: Whisk ketchup, soy sauce, brown sugar, sherry, Worcestershire sauce, and garlic together in a bowl until sugar has dissolved. Set katsu sauce aside.",
                "Preheat an air fryer to 350 degrees F (175 degrees C).",
                "Meanwhile, lay chicken pieces on a clean work surface. Season with salt and pepper.",
                "Place beaten eggs in a flat dish or shallow bowl. Pour bread crumbs into a second flat dish. Dredge chicken pieces in egg and then in bread crumbs. Repeat by dredging chicken in egg and then bread crumbs again, pressing down so the bread crumbs stick to the chicken.",
                "Place chicken pieces in the basket of the preheated air fryer. Spray the tops with nonstick cooking spray.",
                "Air fry for 10 minutes. Flip chicken pieces over using a spatula and spray the tops with nonstick cooking spray. Cook for 8 minutes more. Transfer chicken to a cutting board and slice. Serve with katsu sauce."
            ]
        }
    ],
    "German": [
        {
            "title": "Traditional Sauerbraten",
            "ingredients": [
                "3 pounds beef rump roast",
                "2 large onions, chopped",
                "1 cup red wine vinegar, or to taste",
                "1 cup water",
                "1 tablespoon salt",
                "1 tablespoon ground black pepper",
                "1 tablespoon white sugar",
                "10  whole cloves, or more to taste",
                "2  bay leaves, or more to taste",
                "2 tablespoons all-purpose flour",
                "salt and ground black pepper to taste",
                "2 tablespoons vegetable oil",
                "10  gingersnap cookies, crumbled"
            ],
            "method": [
                "Place beef rump roast, onions, vinegar, water, 1 tablespoon salt, 1 tablespoon black pepper, sugar, cloves, and bay leaves in a large pot. Cover and refrigerate for 2 to 3 days, turning meat daily. Remove meat from marinade and pat dry with paper towels, reserving marinade.",
                "Season flour to taste with salt and black pepper in a large bowl. Sprinkle flour mixture over beef.",
                "Heat vegetable oil in a large Dutch oven or pot over medium heat; cook beef until brown on all sides, about 10 minutes.",
                "Pour reserved marinade over beef, cover, and reduce heat to medium-low. Simmer until beef is tender, 3 1/2 to 4 hours.",
                "Remove beef to a platter and slice.",
                "Strain solids from remaining liquid and continue cooking over medium heat. Add gingersnap cookies and simmer until gravy is thickened, about 10 minutes. Serve gravy over sliced beef."
            ]
        },
        {
            "title": "German Apple Cake",
            "ingredients": [
                "1 cup vegetable oil",
                "2 large eggs",
                "2 cups white sugar",
                "1 teaspoon vanilla extract",
                "2 cups all-purpose flour",
                "2 teaspoons ground cinnamon",
                "1 teaspoon baking soda",
                "½ teaspoon salt",
                "4 cups apples - peeled, cored and diced"
            ],
            "method": [
                "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch cake pan.",
                "Beat oil and eggs in a mixing bowl with an electric mixer until creamy. Add sugar and vanilla; beat well.",
                "Stir together flour, cinnamon, baking soda, and salt in a bowl. Slowly add flour mixture to egg mixture; mix until combined. The batter will be very thick. Fold in apples by hand using a wooden spoon. Spread batter into the prepared pan.",
                "Bake cake in the preheated oven until a toothpick inserted into the center comes out clean, about 45 minutes. Cool cake on a wire rack."
            ]
        },
        {
            "title": "German Pork Chops and Sauerkraut",
            "ingredients": [
                "8  center cut pork chops",
                "2 pounds sauerkraut, drained",
                "1 large red apple, diced",
                "1  onion, chopped",
                "1 cup brown sugar",
                "1 tablespoon caraway seeds"
            ],
            "method": [
                "Preheat the oven to 350 degrees F (175 degrees C).",
                "Heat a large nonstick skillet over medium-high heat. Brown pork chops on both sides, about 5 minutes per side. Place chops into a 9x13-inch baking dish.",
                "Mix sauerkraut, apple, onion, brown sugar, and caraway seeds in a bowl until well combined, and spread the sauerkraut mixture over the pork chops. Cover the dish with aluminum foil.",
                "Bake in the preheated oven until the pork is no longer pink inside, about 45 minutes. An instant-read thermometer inserted into the center of a chop should read 145 degrees F (63 degrees C)."
            ]
        },
        {
            "title": "German Beef Rouladen",
            "ingredients": [
                "¼ cup Dijon mustard",
                "8 (4 ounce) pieces round steak, pounded 1/4 inch thick",
                "½ cup minced onion",
                "2 teaspoons paprika",
                "2 teaspoons salt",
                "2 teaspoons freshly ground black pepper",
                "8 slices bacon",
                "3 tablespoons canola oil",
                "1 (12 ounce) can beef broth",
                "1 ¼ cups water",
                "2 tablespoons cornstarch",
                "1 cup warm water",
                "¼ cup sour cream"
            ],
            "method": [
                "Spread 1/2 tablespoon mustard over one side of each piece of steak; sprinkle onion, paprika, salt, and pepper evenly over the steaks.",
                "Lay one slice of bacon on each piece; roll up steaks jelly roll-style and secure with toothpicks.",
                "Heat canola oil in a skillet over medium heat; cook beef rouladen on all sides until browned. Add broth and water; bring to a boil. Reduce heat to medium-low; cover and simmer until tender, about 30 minutes.",
                "Remove beef rouladen; strain broth mixture and return liquid to the skillet. Whisk cornstarch and 1 cup of water together until smooth; slowly pour cornstarch mixture into the skillet, stirring continually until the sauce has thickened, 2 to 3 minutes.",
                "Stir in sour cream; return rolls to the sauce and serve immediately."
            ]
        }
    ],
    "Chinese": [
        {
            "title": "Shrimp with Broccoli in Garlic Sauce",
            "ingredients": [
                "2 cups fresh broccoli florets",
                "1 tablespoon water",
                "2 tablespoons peanut oil",
                "4 large cloves garlic, minced",
                "1 cup low-sodium chicken broth",
                "1 tablespoon soy sauce",
                "1 tablespoon oyster sauce",
                "2 teaspoons grated fresh ginger root",
                "1 pound uncooked medium shrimp, peeled and deveined",
                "¼ cup canned water chestnuts, drained",
                "2 tablespoons cornstarch"
            ],
            "method": [
                "Combine broccoli and water in a glass bowl; steam in microwave oven until slightly tender, 2 to 3 minutes.",
                "Heat peanut oil in a large skillet or wok over medium-high heat. Add garlic and cook until fragrant, about 1 minute. Reduce heat to low. Add chicken broth, soy sauce, oyster sauce, and ginger root to the garlic; bring to a boil. Add shrimp; cook and stir until the shrimp turn pink, 3 to 4 minutes.",
                "Toss steamed broccoli and water chestnuts with shrimp mixture to coat with sauce. Stir cornstarch into mixture, 1 tablespoon at a time, until sauce thickens, about 5 minutes."
            ]
        },
        {
            "title": "Copycat Panda Express Chow Mein",
            "ingredients": [
                "3 tablespoons canola oil",
                "1 tablespoon sesame oil",
                "1/2  white onion, finely chopped",
                "2 stalks celery, sliced",
                "1 tablespoon fresh ginger",
                "3 cups coleslaw mix",
                "5 ounces bean sprouts",
                "7.1 ounce stir-fry noodles",
                "1/4 cup tamari",
                "2 tablespoons mirin"
            ],
            "method": [
                "Heat canola oil and sesame oil in a wok over high heat. Add onion, celery, and ginger; cook, stirring often, 1 minute. Add coleslaw mix and sprouts; cook, stirring constantly, 2 minutes. Add noodles, and cook, stirring constantly, 1 minute. Add tamari and mirin; cook, stirring occasionally, 2 minutes."
            ]
        },
        {
            "title": "Quick Beef Stir-Fry",
            "ingredients": [
                "2 tablespoons vegetable oil",
                "1 pound beef sirloin, cut into 2-inch strips",
                "1 ½ cups fresh broccoli florets",
                "1  red bell pepper, cut into matchsticks",
                "2  carrots, thinly sliced",
                "1  green onion, chopped",
                "1 teaspoon minced garlic",
                "2 tablespoons soy sauce",
                "2 tablespoons sesame seeds, toasted"
            ],
            "method": [
                "Gather all ingredients.",
                "Heat vegetable oil in a large wok or skillet over medium-high heat; cook and stir beef until browned, 3 to 4 minutes.",
                "Move beef to the side of the wok and add broccoli, bell pepper, carrots, green onion, and garlic to the center of the wok. Cook and stir vegetables for 2 minutes.",
                "Stir beef into vegetables and season with soy sauce and sesame seeds. Continue to cook and stir until vegetables are tender, about 2 more minutes.",
                "Serve hot and enjoy!"
            ]
        },
        {
            "title": "Honey Walnut Shrimp",
            "ingredients": [
                "1 cup water",
                "⅔ cup white sugar",
                "½ cup walnuts",
                "4 large egg whites",
                "⅔ cup mochiko (glutinous rice flour)",
                "1 cup vegetable oil for frying",
                "1 pound large shrimp, peeled and deveined",
                "¼ cup mayonnaise",
                "2 tablespoons honey",
                "1 tablespoon canned sweetened condensed milk"
            ],
            "method": [
                "Stir together water and sugar in a small saucepan over high heat. Bring to a boil and add walnuts. Boil for 2 minutes, then drain and place walnuts on a cookie sheet to dry.",
                "Whip egg whites in a medium bowl until foamy. Stir in mochiko until it has a pasty consistency.",
                "Heat oil in a heavy deep skillet over medium-high heat.",
                "Dip shrimp in mochiko batter, then fry in batches in hot oil until golden brown, about 5 minutes. Remove with a slotted spoon and drain on paper towels.",
                "Stir together mayonnaise, honey, and sweetened condensed milk in a medium serving bowl. Add fried shrimp and toss to coat with sauce. Sprinkle candied walnuts on top and serve."
            ]
        }
    ]
}